import matplotlib.pyplot as plt

# 偏蓝的灰色
blue_gray_color = (0.7, 0.7, 1.0)  
# 偏红的灰色
red_gray_color = (1.0, 0.7, 0.7)
# 创建一些示例数据
y_values_1 = [0.290749,0.288633,0.289291,0.292773,0.293552,0.293663,0.292519,0.295195,0.296307,0.297507]
x_values_1 = [0,4,5,8,11,16,20,25,27,28]

x_values_points_1 = [1,2,3,6,7,9,10,12,13,14,15,17,18,19,21,22,23,24,26,29,30,31,32,33]  # 孤立点的 x 坐标
y_values_points_1 = [0.286377,0.22836,0.273834,0.27712,0.222891,0.288153,0.28664,0.278315,0.284893,0.290451,0.292907,0.29149,0.292122,0.291998,0.248539,0.286135,0.291464,0.287196,0.292662,0.279452,0.289227,0.28835,0.283145,0.287558]        # 孤立点的 y 坐标
# 绘制点线图
plt.plot(x_values_1, y_values_1, marker='o', linestyle='-', color='b', label='stride=0.6 Accepted')
# 绘制孤立的点
plt.scatter(x_values_points_1, y_values_points_1, color=blue_gray_color, label='stride=0.6 Rejected')

# 创建一些示例数据
y_values_2 = [0.290749,0.293733,0.294804,0.295011,0.295135,0.295592,0.298122,0.295506,0.297063,0.296711,0.297832,0.298223]
x_values_2 = [0,1,2,3,7,8,10,14,15,19,20,22]

x_values_points_2 = [4,5,6,9,11,12,13,16,17,18,21,23,24,25,26,27,28,29,30,31,32,33]  # 孤立点的 x 坐标
y_values_points_2 = [0.291709,0.29339,0.29237,0.292621,0.293612,0.292745,0.29394,0.293911,0.292497,0.296018,0.296333,0.295811,0.295198,0.293835,0.293533,0.295656,0.296145,0.293444,0.294995,0.292325,0.295586,0.292881]        # 孤立点的 y 坐标
# 绘制点线图
plt.plot(x_values_2, y_values_2, marker='o', linestyle='-', color='r', label='stride=0.3 Accepted')
# 绘制孤立的点
plt.scatter(x_values_points_2, y_values_points_2, color=red_gray_color, label='stride=0.3 Rejected')


# 添加标题和标签
plt.xlabel('loops')
plt.ylabel('SIM')
# 添加图例
plt.legend()

# 显示图形
plt.show()
